0422/DeskTalk/V2/desk_talk_idf/sdkconfig.defaults
# 2026-09-19: Establish conservative ESP32-S3 defaults for the native ESP-IDF migration baseline.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# 2026-09-19: Match the ESP32-S3-N16R8 module's 16 MB flash and the V1 project partition layout.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 2026-09-19: Enable external RAM and prefer it for large application allocations to preserve internal RAM for TLS and DMA.
CONFIG_SPIRAM=y
# 2026-09-19: Match the N16R8 module's 8 MB Octal PSRAM and use the stable 80 MHz clock.
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
# 2026-09-19: SPIRAM_USE_CAPS_ALLOC and SPIRAM_USE_MALLOC are mutually exclusive; keep malloc integration for large C/C++ allocations.
# CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y
# 2026-09-19: The former 16384-byte threshold kept too many HTTP/TLS helper buffers in scarce internal RAM.
# 2026-09-20: Retain the old threshold; 4 KiB WebSocket RX/TX buffers exhausted contiguous internal task-stack memory.
# CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# 2026-09-20: Match sdkconfig so clean builds also place ASR/TTS frame buffers in PSRAM instead of the task-stack reserve.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
# 2026-09-19: Allow selected long-lived TTS worker stacks in PSRAM to preserve another 12 KiB of internal RAM for concurrent TLS.
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# 2026-09-20: Prefer PSRAM for Wi-Fi/LwIP allocations so WakeNet, task control blocks, DMA, and TLS retain internal RAM.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 2026-09-20: Use the ESP-IDF low-memory Wi-Fi buffer profile; eight static buffers still exceed the six-frame RX BA window.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8

# 2026-09-20: Volcengine's HTTP Upgrade response exceeds 1 KiB; free the larger transport buffer after the handshake completes.
CONFIG_WS_BUFFER_SIZE=4096
CONFIG_WS_DYNAMIC_BUFFER=y

# 2026-09-19: Package WakeNet Hi ESP plus English MultiNet 7 so the native detector recognizes both Hi ESP and Hi Della.
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# 2026-09-19: Release mbedTLS input and output buffers when idle so later TLS coexistence tests have a controlled baseline.
# 2026-09-19: Allocate mbedTLS dynamic state in the N16R8 PSRAM so persistent TTS can coexist with ASR/LLM handshakes; production should pair this with flash encryption when TLS working-memory confidentiality is required.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
# 2026-09-19: IDF 5.1.2 has no MBEDTLS_DYNAMIC_FREE_PEER_CERT option; retain the intended setting as an inactive migration note.
# CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y

# 2026-09-19: Start with IDF's built-in large single-app partition table until the verified Arduino layout is migrated.
# 2026-09-19: The N16R8 layout is now migrated below; retain the former built-in selection as an inactive baseline.
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# 2026-09-19: The built-in table supplies its own filename, so keep the premature custom filename inactive.
# CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp.csv"
